## Introduction to Pandas Data Structures

* To understand Pandas, which is hard, it is helpful to start the data structures it adds to Python:
    * Series - For one dimensional data (lists) 
    * Dataframe - For two dimensional data (spreadsheets)
    * Index - For naming, selecting, and transforming data within a Pandas Series or Dataframe (column and row names)

In [1]:
# import pandas
import pandas as pd

---

## Series

* A one-dimensional array of indexed data
* Kind of like a blend of a Python list and dictionary
* You can create them from a Python list

In [2]:
# creating a series using the top-level pandas function
# Put the cursor inside the parentheses and hit shift-enter
pd.Series()

Series([], dtype: float64)

In [3]:
# Create a regular Python list
my_list = [0.25, 0.5, 0.75, 1.0]

# Transform that list into a Series
data = pd.Series(my_list)

# Display the data in the series
data
#64bit floating point number

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

* A Series is a list-like structure, which means it is *ordered* 
* You can use indexing to grab items in a Series, just like a list
* Those numbers next to the other numbers, that is the *index* to the series
* It is best to use the `iloc` method to grab elements by their location in the series.

In [4]:
# grab the first element
data[0]

0.25

In [5]:
# grab the first element using iloc (index location)
data.iloc[0]

0.25

In [6]:
# grab the 4th elemenet
data.iloc[3]

1.0

#### Quick Exercise
* How might we grab the *last* element if we didn't know the length of the list?

In [9]:
# hint: think small
data.iloc[-1]

1.0

* Also, like lists, you can use *slicing* notation to grab sub-lists
* Again, it is best to use the `.iloc` method

#### Quick Exercise

* Use slices to grab the 2nd and 3rd elements of this series

In [14]:
# hint: the 2nd & 3rd elements are 0.50 and 0.75
# your code below
data.iloc[1:3]
#remmber inclusive and exclusive indexing

1    0.50
2    0.75
dtype: float64

### Index by name

* Series also act like Python dictionaries, *ordered* python dictionaries
* This means you can grab things by name in addition to location

In [15]:
# Create a regular Python Dictionary
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

# Transform that dictionary into a Series 
population = pd.Series(population_dict)

# Display the data
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

* You can also create a named series with multiple lists
* The names and values will be aligned based on the implicit numeric index

In [16]:
# create two ordered lists
population_list = [38332521, 26448193, 19651127, 19552860, 12882135]
states = ['California', 'Texas', 'New York', 'Florida', 'Illinois']

# Create a Series from those two lists
population = pd.Series(population_list, index=states)

# display the data
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

* You can use indexing and slicing like above, but now with keys instead of numbers!
* It is best to use the `.loc` method when looking up things by name instead of by number

In [17]:
# get a value using basic index notation
population['California']

38332521

In [18]:
# basic slicing can be ambitious about names or index values
population[0]

38332521

In [19]:
# select the data value with the name "California"
population.loc['California']

38332521

In [21]:
# What happens if you try an use a name when it wants (iloc req int), location vs index location
population.iloc['California']

38332521

* Like a Python dictionary, a Series is a list of key/value pairs
* But these are *ordered*, which means you can do slicing

#### Quick Exercise

* Try slicing this series, but with names instead of numbers!
* Select a subset of the data using the Python slicing notation
* Don't forget, use `loc`!

In [22]:
# Hint: Use the same : notation, but use the state names listed above, inclusive by name, exclusive by index
#To print seperate items, put list into loc series_name.loc[['name','name']]
# Your code here:

population.loc['Texas':'New York']

Texas       26448193
New York    19651127
dtype: int64

In [23]:
# Try some numeric slicing if you'd like

population.iloc[1:3]

Texas       26448193
New York    19651127
dtype: int64

---

## DataFrame

* `DataFrames` are the real workhorse of Pandas and Python Data Science
* We will be spending a lot of time with data inside of Dataframes, so buckle up!
* `DataFrames` contain two-dimensional data, just like an Excel spreadsheet
* In practice, a `DataFrame` is a bunch of `Series` lined up next to each other

In [24]:
# Start with our population Series
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [25]:
# Then create another Series for the area
area_dict = {'Illinois': 149995, 'California': 423967, 
             'Texas': 695662, 'Florida': 170312, 
             'New York': 141297}
area = pd.Series(area_dict)
area

Illinois      149995
California    423967
Texas         695662
Florida       170312
New York      141297
dtype: int64

In [26]:
# Create a dictionary with a key:value for each column
state_info_dictionary = {'population': population,
                       'area': area}

# Now mash them together into a DataFrame
states = pd.DataFrame(state_info_dictionary)
# Display the data
states

            population    area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

* Pandas automatically lines everything up because they have shared index values
* You can also create Dataframes row by row if your data is more horizontally oriented

In [27]:
# create a list of dictionaries that contain our data.
# one dictionary per observation/row
dead_people = [
    {"ssn":1, "first_name": "Bob", "last_name": "Jones", "age": 200},
    {"ssn":2, "first_name": "Jane", "last_name": "Jones", "age": 199},
    {"ssn":3, "first_name": "Ethel", "last_name": "Jones", "age": 180},
    {"ssn":4, "first_name": "Hortense", "last_name": "Jones", "age": 178},
    {"ssn":5, "first_name": "Vern", "last_name": "Jones", "age": 178}
]

# create a Dataframe from a list of dictionaries
pd.DataFrame(dead_people)

   age first_name last_name  ssn
0  200        Bob     Jones    1
1  199       Jane     Jones    2
2  180      Ethel     Jones    3
3  178   Hortense     Jones    4
4  178       Vern     Jones    5

In [28]:
# create a list of lists, each sub-list is an observation/row
dead_people = [
    [1,"Bob","Jones",200],
    [2,"Jane","Jones",199],
    [3,"Ethel","Jones",180],
    [4,"Hortense","Jones",178],
    [5,"Vern","Jones",178]
]

# specify the column names seperately
column_names = ["ssn","first_name", "last_name", "age"]

# make a Dataframe with column names specified separately
pd.DataFrame(dead_people, columns=column_names)

   ssn first_name last_name  age
0    1        Bob     Jones  200
1    2       Jane     Jones  199
2    3      Ethel     Jones  180
3    4   Hortense     Jones  178
4    5       Vern     Jones  178

In [29]:
# create a list of lists, each sub-list is an observation/row
dead_people = [
    [1,"Bob","Jones",200],
    [2,"Jane","Jones",199],
    [3,"Ethel","Jones",180],
    [4,"Hortense","Jones",178],
    [5,"Vern","Jones",178]
]

# specify the column names seperately
column_names = ["ssn","first_name", "last_name", "age"]

row_ids = [123,3452,3235,4345,563463]

# make a Dataframe with column names specified separately
dead_dataframe = pd.DataFrame(dead_people, columns=column_names, index=row_ids)
dead_dataframe

        ssn first_name last_name  age
123       1        Bob     Jones  200
3452      2       Jane     Jones  199
3235      3      Ethel     Jones  180
4345      4   Hortense     Jones  178
563463    5       Vern     Jones  178

* Using the slicing notation will give you specific columns from the dataframe

In [30]:
dead_dataframe["first_name"]

123            Bob
3452          Jane
3235         Ethel
4345      Hortense
563463        Vern
Name: first_name, dtype: object

* Getting a subset of columns is a bit counter intuitive...

In [33]:
dead_dataframe[["first_name","last_name"]]

       first_name last_name
123           Bob     Jones
3452         Jane     Jones
3235        Ethel     Jones
4345     Hortense     Jones
563463       Vern     Jones

* You need to pass the Dataframe a list of column names

In [32]:
dead_dataframe[["first_name","last_name"]]

       first_name last_name
123           Bob     Jones
3452         Jane     Jones
3235        Ethel     Jones
4345     Hortense     Jones
563463       Vern     Jones

---

## Index

* Pandas `Series` and `DataFrames` are containers for data
* The Index (and Indexing) is the mechanism to make that data retrievable
* In a `Series` the index is the key to each value in the list
* In a `DataFrame` the index is the column names, but there is also an index for each row
* Indexing allows you to merge or join disparate datasets together

In [34]:
states

            population    area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

* You can programmatically access the column and row lables by calling the following functions

In [35]:
# get the column lables as a list-like data structure
states.columns

Index(['population', 'area'], dtype='object')

In [36]:
# get the row labls as a list-like data structure
states.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

* The `loc` method I talked about above allows us to select specific rows and columns *by name*.
* Use the syntax `[<row>,<column>]` with index values

In [37]:
# Get the value of the population column from Illinois
states.loc["Illinois", "population"]

12882135

* We can also be tricky and use more advanced syntax to do more advanced queries.
* You can do any kind of list slicing in place of `<row>` or `<column>` to slice rows and columns

In [38]:
# Get the area for states from Florida to Texas
# this is two dimensional slicing
states.loc["Florida":"Texas", "area"]

Florida     170312
Illinois    149995
New York    141297
Texas       695662
Name: area, dtype: int64

In [39]:
# Get the area for Florida and Texas
# Use a list to select multiple specific values
states.loc[["Florida", "Texas"], "area"]

Florida    170312
Texas      695662
Name: area, dtype: int64

In [40]:
# Get area and population for Florida and Texas
# use a ":" to specify "all columns"
states.loc[["Florida", "Texas"], :]

         population    area
Florida    19552860  170312
Texas      26448193  695662

In [41]:
# select all the rows and columns
states.loc[:,:]

            population    area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

* What is happening here is we are passing a list of names for the rows, and using the colon ":" to say "all columns
* We can do the same thing with column numbers using `iloc`

In [42]:
# Get the area for states from Florida to Texas
# this is two dimensional slicing
states.iloc[1:, 1]

Florida     170312
Illinois    149995
New York    141297
Texas       695662
Name: area, dtype: int64

In [43]:
# Get the area for Florida and Texas
# Use a list to select multiple specific values
states.iloc[[1, 4], 1]

Florida    170312
Texas      695662
Name: area, dtype: int64

In [44]:
# Get the area for Florida and Texas
# Use a list to select multiple specific values
states.iloc[[1, -1], 1]

Florida    170312
Texas      695662
Name: area, dtype: int64

In [45]:
# Get area and population for Florida and Texas
# use a ":" to specify "all columns"
states.iloc[[1, -1], :]

         population    area
Florida    19552860  170312
Texas      26448193  695662

* If you wanted to iterate over your dataframe row by row you can use the `iterrows()` function

In [46]:
for index, row in states.iterrows():
    print(index)
    print(row)
    print() # print a blank line

California
population    38332521
area            423967
Name: California, dtype: int64

Florida
population    19552860
area            170312
Name: Florida, dtype: int64

Illinois
population    12882135
area            149995
Name: Illinois, dtype: int64

New York
population    19651127
area            141297
Name: New York, dtype: int64

Texas
population    26448193
area            695662
Name: Texas, dtype: int64

---

## Exercise

* Using the `iloc` and slicing syntax slice the following dataframe based on the highlighted blocks in the image
* first think of the slicing syntax to grab just the rows you want THEN think of the slicing syntax for the columns you want
* Put the row slices *before* the comma and the column slices *after* the comma

In [47]:
# This is our example Dataframe
indexing_example = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
indexing_example

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

![first slice exercise](images/indexing1.png)
* Select the second two columns of the first two rows.

In [48]:
# Put the slicing syntax in your answer here
indexing_example.iloc[0:2,:]

   0  1  2
0  1  2  3
1  4  5  6

![first slice exercise](images/indexing2.png)
* Select the third row

In [66]:
# Put the slicing syntax in your answer here
indexing_example.iloc[:, 2:3]

   2
0  3
1  6
2  9

![first slice exercise](images/indexing3.png)
* Select the first two columns

In [73]:
# Put the slicing syntax in your answer here
indexing_example.iloc[[0,2],[0,2]]

   0  2
0  1  3
2  7  9

![first slice exercise](images/indexing4.png)
* Select the first two columns of the second row

In [71]:
# Put the slicing syntax in your answer here
indexing_example.iloc[1,0:2]

0    4
1    5
Name: 1, dtype: int64

In [69]:
indexing_example

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

## Exercise Solutions

* Using the `iloc` and slicing syntax slice the following dataframe based on the highlighted blocks in the image
* first think of the slicing syntax to grab just the rows you want THEN think of the slicing syntax for the columns you want
* Put the row slices *before* the comma and the column slices *after* the comma

In [ ]:
# This is our example Dataframe
indexing_example = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
indexing_example

![first slice exercise](images/indexing1.png)
* Select the second two columns of the first two rows.

In [74]:
# Put the slicing syntax in your answer here
indexing_example.iloc[:2, 1:]

   1  2
0  2  3
1  5  6

In [ ]:
# scratch space

![first slice exercise](images/indexing2.png)
* Select the third row

In [ ]:
# Put the slicing syntax in your answer here
indexing_example.iloc[2, :]

In [ ]:
# scratch space

![first slice exercise](images/indexing3.png)
* Select the first two columns

In [75]:
# Put the slicing syntax in your answer here
indexing_example.iloc[:,:2]

   0  1
0  1  2
1  4  5
2  7  8

In [ ]:
# scratch space

![first slice exercise](images/indexing4.png)
* Select the first two columns of the second row

In [ ]:
# Put the slicing syntax in your answer here
indexing_example.iloc[1,:2]

In [ ]:
# scratch space

---